namespace task1_2_3
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.Write("Введите целое положительное число K: ");
            uint K = Convert.ToUInt32(Console.ReadLine()); //ввод числа K
            byte count = 0; //счётчик выводимых чисел на строке
            int last = 2; //последнее простое число
            bool Easy; //изначально простое
            for (int i = 0; i < K; i++) //цикл для вывода простых чисел
            {
                if (count==10) //проверка, что выведено 10 чисел на строке
                {
                    Console.WriteLine(""); //перевод на следующую строку
                    count = 0;
                }
                Console.Write($"{last} "); //вывод простого числа
                if (K == 1) //остановка действия, если требуется только 1 число
                {
                    break;
                }
                do
                {
                    if (last == 2) //проверка, что число равно 2
                    {
                        last++; //увеличение на 1
                    }
                    else
                    {
                        last += 2; //увеличение на 2
                    }
                    Easy = true; //изначально простое
                    //цикл для определения, является ли число простым
                    for (int j=3; j < last; j+=2) 
                    {
                        if (last%j==0) //проверка, что число делится на j
                        {
                            Easy = false; //число не простое
                            break;
                        }
                    }
                    if (Easy) break; //остановка, если было найдено простое число
                } while (!Easy);
                count++; //выведено ещё одно простое число
            }
        }
    }
}
